{"method":"GET","status":"success","generated":"2020-06-23T11:46:44+08:00","conference":{"name":"HKOSCon 2020","sponsors":{"platinum":{"name":"Platinum","sponsors":[{"title":"Microsoft","logo":"https:\/\/events.cota.hk\/sites\/default\/files\/styles\/width_550\/public\/2019-05\/Microsoft.png?itok=Cwy2vlfI","description":"\u003Cp\u003EMicrosoft (Nasdaq “MSFT” @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Our mission is to empower every person and every organization on the planet to achieve more.\u003C\/p\u003E\r\n","links":[{"title":"Website","url":"https:\/\/www.microsoft.com\/en-hk"}]},{"title":"Red Hat","logo":"https:\/\/events.cota.hk\/sites\/default\/files\/styles\/width_550\/public\/2020-05\/redhat-logo-550.png?itok=0dTeR2LU","description":"\u003Cp\u003EWe’re the world’s leading provider of enterprise open source solutions, using a community-powered approach to deliver high-performing Linux, cloud, container, and Kubernetes technologies. We help you standardize across environments, develop cloud-native applications, and integrate, automate, secure, and manage complex environments with award-winning support, training, and consulting services.\u003C\/p\u003E\r\n","links":[{"title":"Website","url":"https:\/\/www.redhat.com\/en"}]}]},"silver":{"name":"Silver","sponsors":[{"title":"MySQL","logo":"https:\/\/events.cota.hk\/sites\/default\/files\/styles\/width_550\/public\/2018-05\/logo-mysql-500.jpg?itok=KnpNnkrq","description":"\u003Cp\u003EMySQL is the world\u0027s most popular OS database. With its proven performance, reliability and ease-of-use, MySQL has become the leading database choice for web-based applications, used by high profile web properties including Facebook, Twitter, YouTube, Yahoo! and many more. Additionally, it is an extremely popular choice as embedded database, distributed by over 3,000 ISVs \u0026amp; OEMs. To organizations in need of an open source, ACID-compliant transactional database delivering real-time in-memory performance and 99.999 percent availability, Oracle offers MySQL Cluster.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EMySQL Enterprise Edition is a commercial offering comprised of the MySQL database with security, encryption, auditing, high availability and scalability extensions, online backup, monitoring, management, and visual database design and SQL development tools. MySQL Enterprise Edition is backed by Oracle Premier support for organizations delivering highly available, business critical applications and services. Oracle MySQL Cloud Service delivers a secure, cost-effective and enterprise-grade MySQL database service. Built on MySQL Enterprise Edition and powered by the Oracle Cloud, it provides a simple, automated, integrated and enterprise ready MySQL cloud service, enabling organizations to increase business agility and reduce costs.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EOracle drives MySQL innovation, constantly improving MySQL solutions and delivering new capabilities to power next generation web, cloud, mobile and embedded applications.\u003C\/p\u003E\r\n","links":[{"title":"MySQL Website","url":"https:\/\/www.mysql.com\/"}]}]},"prize":{"name":"Prize","sponsors":[{"title":"JetBrains","logo":"https:\/\/events.cota.hk\/sites\/default\/files\/styles\/width_550\/public\/2018-05\/jetbrains.jpg?itok=_ZpYZ6_v","description":"\u003Cp\u003EJetBrains is a global software vendor specializing in the creation of intelligent, productivity-enhancing tools for software developers and teams. It maintains its headquarters in Prague, Czech Republic, with R\u0026amp;D labs located in St. Petersburg, Moscow, Novosibirsk, Munich, Amsterdam, and Boston. JetBrains employs more than 1200 people and is grown organically, with no external funding. Its product catalog includes award-winning tools such as IntelliJ IDEA and ReSharper.\u003C\/p\u003E\r\n","links":[{"title":"JetBrains Website","url":"https:\/\/www.jetbrains.com\/"}]}]},"venue":{"name":"Venue","sponsors":[{"title":"Cyberport","logo":"https:\/\/events.cota.hk\/sites\/default\/files\/styles\/width_550\/public\/2020-06\/Cyberport_white.jpg?itok=8r-Lub-v","description":"\u003Cp\u003ECyberport is an innovative digital community with about 1,500 technology companies. It is managed by Hong Kong Cyberport Management Company Limited, which is wholly owned by the Hong Kong SAR Government. With a vision to be the hub for digital technology thereby creating a new economic driver for Hong Kong, Cyberport is committed to nurturing a vibrant tech ecosystem by cultivating talent, promoting entrepreneurship among youth, supporting start-ups on their growth journey, fostering industry development by promoting strategic collaboration with local and international partners, and integrating new and traditional economies by accelerating digital adoption in the public and private sectors.\u003Cbr \/\u003E\r\n\u0026nbsp;\u003Cbr \/\u003E\r\nCyberport focuses on fostering the growth of major technologies application namely FinTech, smart living, digital entertainment \u0026amp; esports, as well as technology development such as artificial intelligence (AI) \u0026amp; big data, blockchain and cybersecurity. With a team of committed professionals providing all round, value-added services, state-of-the-art facilities and smart workspaces to support our digital community, Cyberport is the flagship for Hong Kong’s digital tech industry.\u003C\/p\u003E\r\n","links":[{"title":"Website","url":"http:\/\/www.cyberport.com.hk\/en"}]}]},"design":{"name":"Design","sponsors":[{"title":"Happeas","logo":"https:\/\/events.cota.hk\/sites\/default\/files\/styles\/width_550\/public\/2019-05\/happeas-logo-1000x500.png?itok=Dr2iihwl","description":"\u003Cp\u003EHAPPEAS 蛻變自香港知名 IP 顧問公司 TOBYHK LIMITED，我們去蕪存菁，為客戶提供更專業、更全面的IP設計及顧問服務。我們有超過二十年的巿場推廣及廣告經驗，除了提供自家設計的IP予不同品牌作宣傳或商演，我們亦建立了一套嶄新的、以代言物為重心的廣告宣傳策略，無論對廣告或巿場營銷來說都是一種極具新鮮感。\u003Cbr \/\u003E\r\n\u0026nbsp;\u003Cbr \/\u003E\r\n我們的宏願是為這個冷漠的世界帶來一點轉變，吉祥物能治癒心靈，令人愉快。我們一起創造你獨一無二的吉祥物，並讓他成為你最可靠的超能同伴。\u003Cbr \/\u003E\r\n\u0026nbsp;\u003Cbr \/\u003E\r\nHAPPEAS is metamorphosis of the well-known IP consultant company TOBYHK LIMITED. Our team has over 20 years of solid experience in marketing and advertising. Besides the IP consultant and licensing service, we have developed a Mascot-core advetising approach which is an exclusive advertising and marketing tool.\u003Cbr \/\u003E\r\n\u0026nbsp;\u003Cbr \/\u003E\r\n​Our vision is to make this indifferent world different. A Happy Mascot is our solution.\u003C\/p\u003E\r\n","links":[{"title":"Facebook","url":"https:\/\/www.facebook.com\/HAPPEASHQ\/"}]}]},"tool":{"name":"Tool","sponsors":[{"title":"HackMD","logo":"https:\/\/events.cota.hk\/sites\/default\/files\/styles\/width_550\/public\/2020-05\/hackmd-logo-550.png?itok=7fM5DKAw","description":"\u003Cp\u003EHackMD lets you create realtime collaborative markdown notes on all platforms. It could be used to organize your thoughts, discuss with your teammates, and preview the result in realtime.You write in markdown and we make slides, charts, and math expressions for you!\u003Cbr \/\u003E\r\nSince launch, more than 1,690,000 notes have been taken in HackMD.\u003Cbr \/\u003E\r\nUsers write documents, jot down memos, take meeting minutes, and even debate public issues on HackMD.\u003Cbr \/\u003E\r\nJoin us now! You could write smarter!\u003Cbr \/\u003E\r\nCome and love it \u0026lt;3\u003Cbr \/\u003E\r\n\u0026nbsp;\u003Cbr \/\u003E\r\nHackMD empowers the community\u003C\/p\u003E\r\n","links":[{"title":"Website","url":"https:\/\/www.hackmd.io"}]}]}},"patrons":["Henry Law","Philip Paeps"]}}