{"method":"GET","status":"success","generated":"2020-06-03T16:43:52+08:00","days":[{"day":1,"date":"2020-06-12","timeslots":[{"startTime":"09:30","endTime":"10:00","events":[{"topic":false,"remote_presentation":false,"display":"Reception","description":"","venue":{"name":"","weight":0},"language":"","language_sym_interp":[],"level":"","speakers":[],"video_streaming":null,"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/reception-1"}]},{"startTime":"10:00","endTime":"10:25","events":[{"topic":true,"remote_presentation":false,"display":"Opening Ceremony and Welcome Speech","description":"","venue":{"name":"Main Hall","weight":0},"language":"","language_sym_interp":[],"level":"","speakers":[{"name":"Honorable Charles Mok, JP","community":"Legislative Councillor (Information Technology)","country":"Hong Kong","description":"\u003Cp\u003ECharles Mok, is the Legislative Councillor representing the Information Technology Functional Constituency. He has been serving the ICT industry for more than 20 years. He is currently the Vice Chairman of the Professional Commons, Honorary President of the Hong Kong Information Technology Federation and Founding Chairman of the Internet Society Hong Kong.\u003C\/p\u003E\r\n\r\n\u003Cp\u003ECharles is active in public services with a view to upholding the core values of Hong Kong of which include democracy, liberty, human rights, rule of law and integrity, and is serving on various advisory bodies in the Hong Kong government, Hospital Authority, WKCDA, higher educational institutions,\u0026nbsp;and etc.\u003C\/p\u003E\r\n\r\n\u003Cp\u003ECharles graduated from Purdue University\u0026nbsp;in the United States with his Bachelor and Master degrees of Science in Computer and Electrical Engineering.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2019-04\/22554810_1558827730851215_2768570488786170474_n.jpg"},{"name":"Cyberport","community":"Cyberport","country":"Hong Kong","description":"\u003Cp\u003ECyberport is an innovative digital community with about 1,500 technology companies. It is managed by Hong Kong Cyberport Management Company Limited, which is wholly owned by the Hong Kong SAR Government. With a vision to be the hub for digital technology thereby creating a new economic driver for Hong Kong, Cyberport is committed to nurturing a vibrant tech ecosystem by cultivating talent, promoting entrepreneurship among youth, supporting start-ups on their growth journey, fostering industry development by promoting strategic collaboration with local and international partners, and integrating new and traditional economies by accelerating digital adoption in the public and private sectors.\u003Cbr \/\u003E\r\n\u0026nbsp;\u003Cbr \/\u003E\r\nCyberport focuses on fostering the growth of major technologies application namely FinTech, smart living, digital entertainment \u0026amp; esports, as well as technology development such as artificial intelligence (AI) \u0026amp; big data, blockchain and cybersecurity. With a team of committed professionals providing all round, value-added services, state-of-the-art facilities and smart workspaces to support our digital community, Cyberport is the flagship for Hong Kong’s digital tech industry.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-06\/Cyberport_new.png"}],"video_streaming":null,"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/opening-ceremony-and-welcome-speech"}]},{"startTime":"10:30","endTime":"11:00","events":[{"topic":true,"remote_presentation":false,"display":"Lesson learned with Open Culture under COVID-19 situation","description":"","venue":{"name":"Main Hall","weight":0},"language":"English","language_sym_interp":[],"level":"","speakers":[{"name":"Calvin Tsang","community":"Open Source Hong Kong","country":"Hong Kong","description":"\u003Cp\u003EVice President, Marketing of Open Source Hong Kong\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/CalvinTsang.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/a4nzrblc"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/lesson-learned-open-culture-under-covid-19-situation"}]},{"startTime":"11:05","endTime":"11:35","events":[{"topic":true,"remote_presentation":false,"display":"Democratize Data Literacy with Open-Source Technology","description":"\u003Cp\u003EData literacy - the ability to read, write and communicate with data becomes a necessary competency for an individual to contribute to the already arrived digital economy. In this opening remarks, Dr. Charm will explore how open-source technology is in the unique position to help the organization, and individual, leap-frogging their data literacy maturity.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EOpenCertHub is the self-developed intelligent online examination platform with the latest technology in Facial Recognition, Blockchain \u0026amp; Advanced Analytics. Our vision is to democratize data literacy with open source technology to everyone.\u0026nbsp; We are the only authorized organization delivering\u0026nbsp;\u003Cb\u003ECDP\u003C\/b\u003EOS™ professional examination and certification.\u003C\/p\u003E\r\n","venue":{"name":"Main Hall","weight":0},"language":"English","language_sym_interp":[],"level":"","speakers":[{"name":"Dr. Toa Charm","community":"OpenCertHub","country":"Hong Kong","description":"\u003Cp\u003EChairman, OpenCertHub\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/Dr.Toa%20Charm.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/5npcxdgz"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/democratize-data-literacy-open-source-technology"}]},{"startTime":"11:40","endTime":"12:10","events":[{"topic":true,"remote_presentation":false,"display":"Emergency Response Demo - The Power of Communities","description":"\u003Cp\u003EThe Emergency Response application is a reference demo that showcases the\u0026nbsp;Power of Communities. In particular, it clarifies how the accelerating pace of open-source innovation can be harnessed today on a micro-service, event driven architecture using the products that comprise Red Hat’s\u0026nbsp;Unified Application Environment. It is deployed to and scales horizontally on the premier hybrid cloud platform for enterprise business workloads:\u0026nbsp;Red Hat OpenShift Container Platform.\u003C\/p\u003E\r\n","venue":{"name":"Main Hall","weight":0},"language":"English","language_sym_interp":[],"level":"","speakers":[{"name":"Radar Lui","community":"Red Hat","country":"Hong Kong","description":"\u003Cp\u003ERadar Lui is a Senior Solution Architect in Red Hat Hong Kong who focuses on the application development products including JBoss Middleware and the cloud application platform OpenShift. He is specialized in Java EE application development and system integration on various industries including finance, telecom and government.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/Radar%20Lui.png"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/vrufnsbi"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/emergency-response-demo-power-communities"}]},{"startTime":"12:15","endTime":"12:45","events":[{"topic":true,"remote_presentation":false,"display":"Guide to Responsible AI for Developers","description":"\u003Cp\u003EThe beauty of machines and humans working in tandem gets lost in the discussion about whether A.I. is a good thing or a bad thing. However, perhaps the most productive debate we can have isn’t one of good versus evil. The hard question is how we all can build technology designed in a way that augments human ingenuity and capabilities, human-centered and guided by principles that are core to human rights. Here’s the idea of Responsible AI that is proposed by global tech giants including Microsoft. Join this session to know more about AI ethics and how we can use different tools in our next open sources projects to build inclusive technologies.\u003C\/p\u003E\r\n","venue":{"name":"Main Hall","weight":0},"language":"English","language_sym_interp":[],"level":"","speakers":[{"name":"Verlebie Chan","community":"Microsoft","country":"Hong Kong","description":"\u003Cp\u003ESoftware Development Engineer, Microsoft\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/Verlebie%20Chan.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/n61yg1kd"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/guide-responsible-ai-developers"}]},{"startTime":"12:45","endTime":"14:00","events":[{"topic":false,"remote_presentation":false,"display":"Lunch","description":"","venue":{"name":"","weight":0},"language":"","language_sym_interp":[],"level":"","speakers":[],"video_streaming":null,"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/lunch-0"}]},{"startTime":"14:00","endTime":"14:30","events":[{"topic":true,"remote_presentation":false,"display":"How to build an online learning platform that engages and educates students at scale with Amazon Kendra, Amazon Comprehend, Amazon Translate,and more.","description":"\u003Cp\u003E\u003Cstrong\u003EProblem\u003C\/strong\u003E\u003C\/p\u003E\r\n\r\n\u003Cp\u003ETo be honest, none of the online teaching solution meets the real need of running online lab session. All existing online teaching solutions are just for online meeting or one direction broadcast! Teachers are 100% no way to know your students are really working on their exercise at home or they are just open the online meeting apps, and then doing other stuff!\u003C\/p\u003E\r\n\r\n\u003Cp\u003EThe submission rate of exercise in online class is much higher than face-to-face classes as in general it just needs one student to complete the exercise and share it to the whole class which is much easier so everyone can submit assignment! However, students do not learn anything at all, and the online class is totally useless.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EOn the other hand, most of the students are not willing to ask question during online class. The main difference of online class and face-to-face class is there is lack of interaction. Without classmate or buddy, young students feel boring and alone then they do not join the online class!\u003C\/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003ESolution\u003C\/strong\u003E\u003C\/p\u003E\r\n\r\n\u003Cp\u003EWe develop “All screens” - an AWS Amplify App using most of the Amazon AI services and Amazon Sumerian to address the problem. This project is the extended the concept from our Lab Monitor (AWS Artificial Intelligence (AI) Hackathon 3nd place) This blog post will introduce the features and briefly explain the AWS technologies behind the scene.\u003Cbr \/\u003E\r\n\u0026nbsp;\u003C\/p\u003E\r\n","venue":{"name":"Main Hall","weight":0},"language":"Cantonese","language_sym_interp":["English"],"level":"Beginner","speakers":[{"name":"Cyrus Wong","community":"IVE","country":"Hong Kong","description":"\u003Cp\u003ECyrus Wong is Data Scientist of Cloud Innovation Centre at the IT Department of the Hong Kong Institute of Vocational Education (Lee Wai Lee). He has achieved all 12 AWS Certifications and actively promotes the use of AWS in different media and events. His projects received four Hong Kong ICT Awards in 2014, 2015, and 2016, and all winning projects are running solely on AWS with Data Science and Machine Learning. One of the winning projects is “AWS Cloud Lab Environment,” an open-sourced project for educators to create tailor-made lab environments on AWS.\u003C\/p\u003E\r\n\r\n\u003Cp\u003ECyrus also helps to deliver the full-time course “Higher Diploma in Cloud and Data Centre Administration,” which is the first tertiary course in Asia dedicated to provide Cloud Technology training. The course is committed to providing AWS Academy training to Hong Kong students and Cyrus is an AWS Academy Accredited Trainer. He incorporates AI\/ML into his daily curriculum and often writes about projects. Examples include: Analyze Emotion in Video Frame Samples Using Amazon Rekognition on AWS, Build an Amazon Lex Chatbot with Microsoft Excel, and Using AWS AI and Amazon Sumerian in IT Education.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/Cyrus%20Wong.JPG"},{"name":"Ng Sin Ching, Mike","community":"","country":"Hong Kong","description":"\u003Cp\u003EStudies Higher Diploma in Cloud and Data Centre Administration in IVE(LWL) taught by AWS Machine Learning Hero Cyrus Wong. One of the team member of ‘Lab Monitor\u0027 who won the third-place in AWS AI Hackathon 2018. Currently working as a Technical Program Intern in AWS HK solution architect team, focus on supporting Solution Architect teams on performing PoC projects, building demo kits, and hosting public technical workshops in Hong Kong.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/Mike%20Ng.jpg"},{"name":"Lam Pak Yin, Sam","community":"","country":"Hong Kong","description":"\u003Cp\u003EStudies Higher Diploma in Cloud and Data Centre Administration in IVE(LWL). I am interested in AWS Cloud technologies such as big data analysis, Al and machine learning.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/Sam%20Lam.jpg"},{"name":"Law Mei Ching, Pearly","community":"","country":"Hong Kong","description":"\u003Cp\u003EI will study Higher Diploma in Cloud and Data Centre Administration in IVE(LWL). I am one of the team member of ‘Lab Monitor\u0027 who won the third-place in AWS AI Hackathon 2018, the youngest girl AWS DeepRacer player of the world, and the youngest girl with AWS certification.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/Pearly%20Law.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/a60mam2b"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/how-build-online-learning-platform-engages-and-educates-students-scale-amazon-kendra-amazon"}]},{"startTime":"14:35","endTime":"15:05","events":[{"topic":true,"remote_presentation":true,"display":"LibreOffice: the current status of the most powerful OSS office suite","description":"\u003Cp\u003ELibreOffice is a successor of OpenOffice.org and full-featured open-source office software. It is a large application written in 9 million lines of C ++, with an estimated 200 million users worldwide. \u0026nbsp;It has been known as a desktop application, but for resenting years the \u0022online\u0022 version, which allows edit documents via modern web browsers, has also be developed, and mobile versions will also be available soon.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EThis talk will introduce the current state of both the LibreOffice product and development, such as compatibility improvement with proprietary application document formats, document confidentiality using OpenGPG, improved spreadsheet performance through multi-threading, LibreOffice Online implementation, etc.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EAnd also, it will introduce activities in Asian regions to improve regional-specific features such as CJK rendering.\u003C\/p\u003E\r\n","venue":{"name":"Main Hall","weight":0},"language":"English","language_sym_interp":[],"level":"Beginner","speakers":[{"name":"Naruhiko Ogasawara","community":"LibreOffice Japanese Team","country":"Japan","description":"\u003Cp\u003ENaruhiko Ogasawara is a member of the LibreOffice Japanese Team, a project to support the use of LibreOffice in Japanese, and a member of The Document Foundation, the home of LibreOffice. He is in charge of UI translation lead, communication with foreign countries, event organizer, etc. He loves Ubuntu as his usual desktop.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/Naruhiko%20Ogasawara.JPG"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/kxsqe0wx"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/libreoffice-current-status-most-powerful-oss-office-suite"}]},{"startTime":"15:10","endTime":"15:40","events":[{"topic":true,"remote_presentation":false,"display":"Open by default: trying to run a startup with open source culture in mind","description":"\u003Cp\u003EWe all love open source software and open culture, and of course we all want to contribute to and leverage the power of open source in our work. However when it comes to working in a startup, openness is often sacrificed to give way to work efficiency and business logic. In this talk I will talk about some of my experience(and failures) to be open source, and how our company is trying to be open by default without too much efficiency overhead.\u003C\/p\u003E\r\n","venue":{"name":"Main Hall","weight":0},"language":"Cantonese","language_sym_interp":["English"],"level":"Beginner","speakers":[{"name":"William Chong","community":"LikeCoin Foundation","country":"Hong Kong","description":"\u003Cp\u003EFullstack Developer and Game Developer, likes to contribute to opensource in both work and free time, currently one of the most active GitHub user in Hong Kong.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/William%20Chong.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/hnpoz3xu"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/open-default-trying-run-startup-open-source-culture-mind"}]},{"startTime":"15:40","endTime":"16:00","events":[{"topic":false,"remote_presentation":false,"display":"Break","description":"","venue":{"name":"","weight":0},"language":"","language_sym_interp":[],"level":"","speakers":[],"video_streaming":null,"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/break"}]},{"startTime":"16:00","endTime":"16:30","events":[{"topic":true,"remote_presentation":true,"display":"How I do troubleshooting on container, more than docker?","description":"\u003Cp\u003EThe holy grail of Cloud Native tech is to have zero vendor lock-in. Container makes everything easier. But even with the easiest platform, sometimes you still need to run into problems. In this talk, Phil will share the knowledge about how to diagnose and troubleshoot container (podman, docker) and container platform (Kubernetes, OpenShift).\u003C\/p\u003E\r\n","venue":{"name":"Main Hall","weight":0},"language":"Mandarin","language_sym_interp":["English"],"level":"Advanced","speakers":[{"name":"Phil Huang","community":"Cloud Native Taiwan User Group","country":"Taiwan","description":"\u003Cp\u003EPhil Huang (黃秉鈞) is an active member in Cloud Native Taiwan User Group.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EHe currently serves as Red Hat Hong Kong \/ Taiwan Solution Architect. Phil is passionate about implementation, sharing and problem solving. In his free time, he also write a blog, Phil Workspace (\u003Ca href=\u0022https:\/\/blog.pichuang.com.tw\/\u0022\u003Eblog.pichuang.com.tw\/\u003C\/a\u003E), that share knowledges and write-up posts to the world.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/Phil%20Huang.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/i4m8sede"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/how-i-do-troubleshooting-container-more-docker"}]},{"startTime":"16:35","endTime":"17:05","events":[{"topic":true,"remote_presentation":false,"display":"GitHub Actions: your free CI engine (and much more)","description":"\u003Cp\u003EGitHub Actions is now the second most popular Build Platform on GitHub.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EBut it is also much more than than a CI system: it is a very powerful automation engine.\u003C\/p\u003E\r\n\r\n\u003Cp\u003ELet take a look at how we can do CI with Actions, and how we can automate operations on our GitHub projects.\u003C\/p\u003E\r\n","venue":{"name":"Main Hall","weight":0},"language":"English","language_sym_interp":[],"level":"Intermediate","speakers":[{"name":"Davide Benvegnu","community":"Microsoft","country":"Hong Kong","description":"\u003Cp\u003EWith over 16 years of experience in software development and IT, Davide is a DevOps Architect at Microsoft and GitHub, helping some of the biggest enterprise companies in Asia on their DevOps transformations.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EPreviously he\u0027s been Cloud Solution Architect for Microsoft, working with the Strategic Accounts.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EBefore that he was the CTO for DBTek, a Software House and IT consultancy company in Hong Kong. He\u0027s also been International Development Manager for Aruba, the biggest Italian web services provider.\u0026nbsp;\u003C\/p\u003E\r\n\r\n\u003Cp\u003EHe has been awarded by Microsoft with the MVP (Most Valuable Professional) in ALM title in 2015, 2016 and 2017.\u0026nbsp;\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/DavideBenvegnu.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/h2wze7f4"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/github-actions-your-free-ci-engine-and-much-more"}]},{"startTime":"17:10","endTime":"17:40","events":[{"topic":true,"remote_presentation":false,"display":"ZFS","description":"\u003Cp\u003EWatch Trouble present a three-day workshop on ZFS in however little time the conference organisers were willing to allocate for it!\u0026nbsp;\u003C\/p\u003E\r\n\r\n\u003Cp\u003EWe\u0027ll cover topics from filesystem reliability over snapshots and volume management to future directions in ZFS.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EZFS is known as \u0022the last word in filesystems\u0022. This workshop will get your hands dirty with installing, configuring and managing reliable and scalable storage systems with ZFS on FreeBSD. We will cover pool-based storage, optimising storage systems for performance and redundancy and practise zero-downtime recovery from common storage events such as failing disks or running out of space.\u003C\/p\u003E\r\n","venue":{"name":"Main Hall","weight":0},"language":"English","language_sym_interp":[],"level":"Beginner","speakers":[{"name":" Philip Paeps","community":"FreeBSD Foundation","country":"Belgium","description":"\u003Cp\u003EPhilip Paeps (“Trouble”) is an independent consultant and contractor. He provides research and development on low-level software and operating systems, particularly in an embedded or real-time context. His main interests are bootloaders, device drivers and high-performance networking. He can also be convinced to teach courses and workshops on a variety of networking-related topics.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EIn his so-called free time, Philip is a FreeBSD committer contributing mainly to the kernel and a member of the FreeBSD security team. He was one of the main organisers of FOSDEM, the largest annual open source software conference in Europe, from the early 2000s until 2015. He denies having any involvement with amateur radio or tabletop role playing games.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2019-04\/mugshot-t.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/hkcwqrbe"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/zfs"}]},{"startTime":"17:40","endTime":"17:45","events":[{"topic":false,"remote_presentation":false,"display":"Announcement and End of Day 1","description":"","venue":{"name":"Main Hall","weight":0},"language":"","language_sym_interp":[],"level":"","speakers":[],"video_streaming":null,"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/announcement-and-end-day-1"}]}]},{"day":2,"date":"2020-06-13","timeslots":[{"startTime":"09:30","endTime":"10:00","events":[{"topic":false,"remote_presentation":false,"display":"Reception","description":"","venue":{"name":"","weight":0},"language":"","language_sym_interp":[],"level":"","speakers":[],"video_streaming":null,"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/reception-1"}]},{"startTime":"10:00","endTime":"10:30","events":[{"topic":true,"remote_presentation":false,"display":"OAO - User Orientation Cloud Architecture for the Pi","description":"\u003Cp\u003EI will be introducing a new open source project written by myself for 4 years named \u0022Open ArOZ Online\u0022 (OAO), which is a light weight user orientated cloud architecture for the Raspberry Pi series. It support IoT functionality, media streaming and more with an easy to use Web Desktop User Interface just like a normal operating system. Expected to be completed and release on Github in late April to early May. This talk will be a quick introduction to such a system, a quick hand-on tutorial and basic introduction on the architecture of the system modular design framework.\u003C\/p\u003E\r\n","venue":{"name":"Hall A","weight":1},"language":"Cantonese","language_sym_interp":["English"],"level":"Beginner","speakers":[{"name":"Toby Chui","community":"The Hong Kong Polytechnic University","country":"Hong Kong","description":"\u003Cp\u003EFull Time Student in Computing, Maker\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/Toby%20Chui.png"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/eccia2mv"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/oao-user-orientation-cloud-architecture-pi"},{"topic":true,"remote_presentation":false,"display":"Decentralized content registry: expanding IPFS functionality with cosmos based blockchain","description":"\u003Cp\u003EWe are building a general digital content registry called International Standard Content Number (ISCN) which is using the Cosmos-based blockchain to validate and store the registry itself. However, it is not intuitive and easy to use for users to query the registry directly from the blockchain, and now we are riding on the powerful distributed file system InterPlanetary File System (IPFS) to make some plugins to help to distribute the registries globally decentrally and distributed.\u003C\/p\u003E\r\n","venue":{"name":"Hall B","weight":2},"language":"English","language_sym_interp":[],"level":"Intermediate","speakers":[{"name":"Aludirk Wong","community":"LikeCoin Foundation","country":"Hong Kong","description":"\u003Cp\u003EAludirk is a system architect of the LikeCoin Foundation, an open source blockchain based project to reinvent the Like by realigning creativity and reward. He is interested in system design, deep learning and blockchain technology.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2018-05\/Aludirk%20Wong.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/vyb6enea"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/decentralized-content-registry-expanding-ipfs-functionality-cosmos-based-blockchain"}]},{"startTime":"10:40","endTime":"11:10","events":[{"topic":true,"remote_presentation":false,"display":"Julia -- Looks like Python, feels like Lisp, runs like C\/Fortran","description":"\u003Cp\u003EJulia is a fast, dynamic, open source, easy to use programming language, designed to solve the two-language problem. It provides ease in both syntax and speed, and adopts multiple dispatch as its paradigm. In this talk, we will give an overview of the strengths and applications of Julia, as well as cover its basic syntax. Through a short live coding demonstration and text game AI with the Flux.jl package, we will demonstrate Julia\u0027s ease of use and comprehensive support for Machine Learning and Scientific Computing.\u003C\/p\u003E\r\n","venue":{"name":"Hall A","weight":1},"language":"English","language_sym_interp":[],"level":"Intermediate","speakers":[{"name":"Choi Ching Lam","community":"The Julia Language Community","country":"Hong Kong","description":"\u003Cp\u003EChoi Ching Lam and Kim Fung are members of The Julia Language Community and Julia Student Club leaders at their respective high schools. Both involved in the open source initiative Google Code In Julia track, Ching Lam and Kim have worked with various Julia packages including Flux.jl, Makie.jl and NeuralNetDiffE.jl. Ching Lam is keenly interested in Computer Vision and Scientific Computing, is currently an intern at NVIDIA\u0027s AI Tech Center, and aspires to become a researcher. Kim is passionate about Data Science and Philosophy, aims to drive change with Open Source, and aspires to create a startup in the future.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/Choi%20Ching%20Lam.jpg"},{"name":"Kim Fung","community":"The Julia Language Community","country":"Hong Kong","description":"\u003Cp\u003EChoi Ching Lam and Kim Fung are members of The Julia Language Community and Julia Student Club leaders at their respective high schools. Both involved in the open source initiative Google Code In Julia track, Ching Lam and Kim have worked with various Julia packages including Flux.jl, Makie.jl and NeuralNetDiffE.jl. Ching Lam is keenly interested in Computer Vision and Scientific Computing, is currently an intern at NVIDIA\u0027s AI Tech Center, and aspires to become a researcher. Kim is passionate about Data Science and Philosophy, aims to drive change with Open Source, and aspires to create a startup in the future.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/Kim%20Fung.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/cvadrudh"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/julia-looks-python-feels-lisp-runs-cfortran"},{"topic":true,"remote_presentation":false,"display":"Service mesh on OpenShift","description":"\u003Cp\u003EThe term service mesh is used to describe the network of microservices that make up such applications and the interactions between them. As a service mesh grows in size and complexity, it can become harder to understand and manage. Its requirements can include traffic management, observability, policy enforcement, service identity and security.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EIn this session, we will take a look at Istio and how it provides behavioral insights and operational control over the service mesh as a whole, offering a complete solution to satisfy the diverse requirements of microservice applications.\u003C\/p\u003E\r\n","venue":{"name":"Hall B","weight":2},"language":"English","language_sym_interp":[],"level":"","speakers":[{"name":"Frankie Ng","community":"Red Hat","country":"Hong Kong","description":"\u003Cp\u003EMr. Frankie Ng is a Senior Solution Architect in Red Hat. He was focusing on OpenStack and SDN technologies. Previously, Frankie served as a cloud engineer in Telcom and led the development in IaaS platform. Frankie received his MSc in Information Engineering from Chinese University of Hong Kong.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/Frankie%20Ng.png"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/2gktw7o5"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/service-mesh-openshift"}]},{"startTime":"11:20","endTime":"11:50","events":[{"topic":true,"remote_presentation":true,"display":"Rust and WebAssembly powered Microservices","description":"\u003Cp\u003EThe Rust programming language is Stackoverflow’s most beloved programming language for the past 4 years. As it\u0027s adoption reaches beyond alpha developers writing system software, there is a strong demand for using Rust to write web services and applications.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EOriginally created by Mozilla, Google, Microsoft, and Apple as the next generation code execution engine web browsers, WebAssembly is the ideal execution engine for running Rust applications on the server side.\u0026nbsp;\u003C\/p\u003E\r\n\r\n\u003Cp\u003ECompared with Java and JavaScript, WebAssembly supports many more programming languages including the popular Rust, Go, Python and others. WebAssembly is also much closer to the underlying hardware, and hence much more performant than Java and JavaScript.\u003C\/p\u003E\r\n\r\n\u003Cp\u003ECompared with low level virtualization containers like Docker, WebAssembly is lighter, safer, and easier to manage. WebAssembly is supported on almost any computer operating system today. WebAssembly bytecode applications can just run anywhere. There is no need to package an operating system inside your virtual machine like Docker does.\u0026nbsp;\u003C\/p\u003E\r\n\r\n\u003Cp\u003EBeing a bytecode virtual machine, WebAssembly has a well-designed security model for accessing hardware. It is a lot harder to crash or do dangerous things in WebAssembly than in a native environment like Docker.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EIn this talk, we will review recent open source innovations that bring WebAssembly-based services to the market. We will provide a live demo on how to create and deploy a Rust application and deploy it on WebAssembly as a microservice. Topics we will cover include the following.\u0026nbsp;\u003C\/p\u003E\r\n\r\n\u003Cp\u003EIntroduction to Rust and WebAssembly\u003C\/p\u003E\r\n\r\n\u003Cul\u003E\r\n\t\u003Cli\u003EThe case for WebAssembly on the server\u003C\/li\u003E\r\n\t\u003Cli\u003EWebAssembly implementations that are optimized for the server side\u003C\/li\u003E\r\n\t\u003Cli\u003EDependency Injection container for WebAssembly\u003C\/li\u003E\r\n\t\u003Cli\u003ERPC services for WebAssembly\u003C\/li\u003E\r\n\t\u003Cli\u003EA complete stateless microservice example in Rust\u003C\/li\u003E\r\n\t\u003Cli\u003EA complete stateful microservice example in Rust\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003EAudience\u003C\/strong\u003E\u003C\/p\u003E\r\n\r\n\u003Cp\u003ESoftware developers, CIOs, CTOs, IT managers\u003C\/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003ETakeaway\u003C\/strong\u003E\u003C\/p\u003E\r\n\r\n\u003Cp\u003EThe audience will learn basic concepts of Rust and WebAssembly. At the end of the session, they will be able to write and deploy a Rust-based web service in the cloud on their own.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003EPrerequisite\u003C\/strong\u003E\u003C\/p\u003E\r\n\r\n\u003Cp\u003EFamiliarity with cloud computing, familiarity with web services, working knowledge of at least one commonly used programming language.\u003C\/p\u003E\r\n","venue":{"name":"Hall A","weight":1},"language":"English","language_sym_interp":[],"level":"Intermediate","speakers":[{"name":"Michael Yuan","community":"Second State Inc","country":"United States","description":"\u003Cp\u003EDr. Michael Yuan is the CEO of the Second State Inc, and a co-founder of the CyberMiles Foundation. He is the author of textbook Building Blockchain Applications published by Addison-Wesley. Dr. Yuan has extensive experience developing and commercializing Open Source software. His past experience includes product management and developer programs in major open source companies such as JBoss and RedHat. Dr. Yuan received a PhD in Astrophysics from the University of Texas at Austin.\u003C\/p\u003E\r\n\r\n\u003Cp\u003ESecond State builds WebAssembly execution engines, frameworks, and developer toolchain for the cloud.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/Michael%20Yuan.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/w6zbzys4"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/rust-and-webassembly-powered-microservices"},{"topic":true,"remote_presentation":true,"display":"Containerize Apps with Kubernetes on Azure","description":"\u003Cp\u003EDo you dream of a fast, scalable, stable, available, and simple application all the time? Well, this may not be a dream anymore! Let\u0027s discuss what Kubernetes is and how we can improve our whole infrastructure using this awesome orchestrator, so we never need to worry about scalability and maintenance issues anymore!\u003C\/p\u003E\r\n","venue":{"name":"Hall B","weight":2},"language":"English","language_sym_interp":[],"level":"","speakers":[{"name":"Lucas Santos","community":"Microsoft","country":"Hong Kong","description":"\u003Cp\u003ECloud Developer Advocate at Microsoft\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/Lucas%20Santos.png"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/b1peatjt"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/containerize-apps-kubernetes-azure"}]},{"startTime":"11:50","endTime":"12:10","events":[{"topic":false,"remote_presentation":false,"display":"Break","description":"","venue":{"name":"","weight":0},"language":"","language_sym_interp":[],"level":"","speakers":[],"video_streaming":null,"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/break"}]},{"startTime":"12:10","endTime":"12:40","events":[{"topic":true,"remote_presentation":false,"display":"MySQL High Availability Deployment Practice","description":"\u003Cp\u003EData is critical to system. Building a reliability system requires a reliable Database Platform. MySQL High Availability with Replication, InnoDB Cluster \/ NDB Cluster provides the choice of deployment architectures to achieve different Service level (SLA) expectations. The talk will cover the innovation of Today with MySQL replication capabilities including Network communication, Flow control and Data Consistency. The latest ReplicaSet and InnoDB Cluster will be explored.\u003C\/p\u003E\r\n","venue":{"name":"Hall A","weight":1},"language":"English","language_sym_interp":[],"level":"Intermediate","speakers":[{"name":"Ivan Ma","community":"Hong Kong MySQL User Group","country":"Hong Kong","description":"\u003Cp\u003EIvan Ma is the MySQL User Group Lead in Hong Kong. He has over 20+ years of experience in enterprise system infrastructure and software technologies.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EHe Joined MySQL, is currently MySQL Principal Solution Engineer, Asia Pacific with Oracle, responsible for pre-sales consulting, technical education, and product promotions.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EHe joined Oracle in System Team from Sun Mircosystems acquisition. Prior to Sun Microsystems, he was Principal Solution Architect with Sybase APAC covering APAC regions.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2019-03\/Ivan%20Ma_0.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/bygnxy6z"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/mysql-high-availability-deployment-practice"},{"topic":true,"remote_presentation":false,"display":"Ansible: From VM to Kubernetes","description":"\u003Cp\u003EBy using Ansible for DevOps, we could manage both VM, Docker image provision, Kubernetes and CephFS provision, or even Kubernetes Pod runtime management.\u003C\/p\u003E\r\n","venue":{"name":"Hall B","weight":2},"language":"Cantonese","language_sym_interp":["English"],"level":"Intermediate","speakers":[{"name":"Wong Hoi Sing Edison","community":"PantaRei Design Limited","country":"Hong Kong","description":"\u003Cp\u003EOpen Source Developer, Drupal Developer, Ansible Developer, Kubernetes User\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2019-03\/Wong%20Hoi%20Sing%20Edison.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/ulysovil"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/ansible-vm-kubernetes"}]},{"startTime":"12:50","endTime":"13:20","events":[{"topic":true,"remote_presentation":true,"display":"MySQL Security Best Practice","description":"\u003Cp\u003EI will talk the security challenges for modern databases, and the out-of box security features that you can get from MySQL to deal with those challenges. I also will show you how to build a bulletproof application systems with features from MySQL 8.0 and MySQL Enterprise Edition.\u003C\/p\u003E\r\n","venue":{"name":"Hall A","weight":1},"language":"English","language_sym_interp":[],"level":"Intermediate","speakers":[{"name":"Ivan Tu（杜修文）","community":"Taiwan MySQL User Group","country":"Taiwan","description":"\u003Cp\u003EIvan Tu (杜修文) is the manager of MySQL Greater China and Korea Solution Engineering team, his team is promoting MySQL technology and helps enterprise users to apply MySQL, and join large scale MySQL projects of critical customers in GC\u0026amp;KR region.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EHe is certified with MySQL DBA and MySQL Cluster Administrator in 2010.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EHe also hosts Taiwan MySQL User Group - a very active community with more than 3100 members, he organizes monthly group meetings to share MySQL technologies and best practices to the audience.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2019-03\/Ivan%20Tu.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/ivwvh3v9"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/mysql-security-best-practice"},{"topic":true,"remote_presentation":false,"display":"Ansible: From VM to Kubernetes","description":"\u003Cp\u003EBy using Ansible for DevOps, we could manage both VM, Docker image provision, Kubernetes and CephFS provision, or even Kubernetes Pod runtime management.\u003C\/p\u003E\r\n","venue":{"name":"Hall B","weight":2},"language":"Cantonese","language_sym_interp":["English"],"level":"Intermediate","speakers":[{"name":"Wong Hoi Sing Edison","community":"PantaRei Design Limited","country":"Hong Kong","description":"\u003Cp\u003EOpen Source Developer, Drupal Developer, Ansible Developer, Kubernetes User\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2019-03\/Wong%20Hoi%20Sing%20Edison.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/ulysovil"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/ansible-vm-kubernetes"}]},{"startTime":"13:20","endTime":"14:20","events":[{"topic":false,"remote_presentation":false,"display":"Lunch","description":"","venue":{"name":"","weight":0},"language":"","language_sym_interp":[],"level":"","speakers":[],"video_streaming":null,"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/lunch-0"}]},{"startTime":"14:20","endTime":"14:50","events":[{"topic":true,"remote_presentation":false,"display":"Cyberport - TBC","description":"","venue":{"name":"Hall A","weight":1},"language":"","language_sym_interp":[],"level":"","speakers":[],"video_streaming":null,"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/cyberport-tbc"},{"topic":true,"remote_presentation":false,"display":"Automating Kubernetes with GitOps","description":"\u003Cp\u003EThe workshop will give a hand-on experience about Kubernetes and also how to manage the Kubernetes cluster in GitOps via Weaveworks FluxCD\u003C\/p\u003E\r\n","venue":{"name":"Hall B","weight":2},"language":"Cantonese","language_sym_interp":["English"],"level":"Intermediate","speakers":[{"name":"Dick Tang","community":"HK01","country":"Hong Kong","description":"\u003Cp\u003EDick Tang is currently the Director of DevOps at HK01. He is leading his team building various backend infrastructure and improving development workflow to better serve the expanding products and the rapidly growing user traffic.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EBefore joining HK01, Dick was a DevOps Engineer at 9GAG, helping 9GAG move fast with stable and reliable backend infrastructure system.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2019-03\/Dick%20Tang.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/w5hg1dn4"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/automating-kubernetes-gitops"}]},{"startTime":"15:00","endTime":"15:30","events":[{"topic":true,"remote_presentation":true,"display":"Build and maintain Civil Infrastructure Platform by using open source projects","description":"\u003Cp\u003EThe Linux Foundation launched the Civil Infrastructure Platform (CIP) project to develop base layer, open source industrial-grade software for civil infrastructure projects, the CIP supports electrical and power grids, railway, shipping, and transportation systems, among other applications that are imperative to human life. There\u0027re several workgroups in this project, such as Linux kernel, real-time, testing, security, and software update.\u0026nbsp;\u003C\/p\u003E\r\n\r\n\u003Cp\u003EIt\u0027s vital for open source license compliance; therefore, the OpenChain Project defines the key requirements of a quality open source compliance program, which provides a standard to build trust between companies in the supply chain while reducing internal resource costs.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EIn this presentation, SZ Lin will share the project\u0027s status and experiences in CIP and OpenChain project.\u003C\/p\u003E\r\n","venue":{"name":"Hall A","weight":1},"language":"English","language_sym_interp":[],"level":"Beginner","speakers":[{"name":"SZ Lin（林上智）","community":"Moxa Inc.","country":"Taiwan","description":"\u003Cp\u003ESZ Lin currently works for Moxa in the Software Development Center, and his team helps develop industrial-grade Linux distribution to adapt in the various products, especially the industrial related systems. His research interests include embedded Linux, cybersecurity, and open source projects. Being a Debian developer, he mainly contributes and maintains open-source software in the security tools packaging team.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EHe is the technical steering committee member and the former chairperson of Linux kernel workgroup in the Linux foundation project - Civil Infrastructure Platform, and he is also the governing board member in the Linux foundation project - OpenChain to define the key requirements of a quality open source compliance program.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-06\/SZ%20Lin.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/zuzib3vj"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/build-and-maintain-civil-infrastructure-platform-using-open-source-projects"},{"topic":true,"remote_presentation":false,"display":"Automating Kubernetes with GitOps","description":"\u003Cp\u003EThe workshop will give a hand-on experience about Kubernetes and also how to manage the Kubernetes cluster in GitOps via Weaveworks FluxCD\u003C\/p\u003E\r\n","venue":{"name":"Hall B","weight":2},"language":"Cantonese","language_sym_interp":["English"],"level":"Intermediate","speakers":[{"name":"Dick Tang","community":"HK01","country":"Hong Kong","description":"\u003Cp\u003EDick Tang is currently the Director of DevOps at HK01. He is leading his team building various backend infrastructure and improving development workflow to better serve the expanding products and the rapidly growing user traffic.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EBefore joining HK01, Dick was a DevOps Engineer at 9GAG, helping 9GAG move fast with stable and reliable backend infrastructure system.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2019-03\/Dick%20Tang.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/w5hg1dn4"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/automating-kubernetes-gitops"}]},{"startTime":"15:30","endTime":"15:50","events":[{"topic":false,"remote_presentation":false,"display":"Break","description":"","venue":{"name":"","weight":0},"language":"","language_sym_interp":[],"level":"","speakers":[],"video_streaming":null,"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/break"}]},{"startTime":"15:50","endTime":"16:20","events":[{"topic":true,"remote_presentation":true,"display":"區塊鏈產業與開源文化的交集：信任以及共識","description":"\u003Cp\u003E\r\n\u003Cstyle type=\u0022text\/css\u0022\u003E\u003C!--td {border: 1px solid #ccc;}br {mso-data-placement:same-cell;}--\u003E\r\n\u003C\/style\u003E\r\n即使比特幣的誕生剛過十年，區塊鏈仍是一個高速發展中的新興產業，其去中心化的本質，與開源文化有許多相似之處，將程式碼公開，更是取得信任的重要環節，此次分享將會探討區塊鏈的社群文化以及信任的重要性。\u003C\/p\u003E\r\n","venue":{"name":"Hall A","weight":1},"language":"English","language_sym_interp":[],"level":"","speakers":[{"name":"Charles Jhong","community":"AMIS","country":"Taiwan","description":"\u003Cp\u003E關注區塊鏈的軟體工程師，當兵時好奇買了台礦機挖比特幣，不小心就掉進區塊鏈這個坑，目前任職於 AMIS 公司負責區塊鏈產品開發\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-06\/Charles%20Jhong.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/qykzlggj"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/qukuailianchanyeyukaiyuanwenhuadejiaojixinrenyijigongshi"},{"topic":true,"remote_presentation":false,"display":"TVHK","description":"\u003Cp\u003EAn TV platform that is owned by and beneficial to the community.\u003C\/p\u003E\r\n","venue":{"name":"Hall B","weight":2},"language":"English","language_sym_interp":[],"level":"Intermediate","speakers":[{"name":"Frankie Yuen","community":"The Loop","country":"Hong Kong","description":"\u003Cp\u003EAn ever-learning maker\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/Frankie%20Yuen.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/usshrgbn"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/tvhk"}]},{"startTime":"16:30","endTime":"17:00","events":[{"topic":true,"remote_presentation":true,"display":"The Hitchhiker’s guide to Servo Contributor","description":"\u003Cp\u003E\r\n\u003Cstyle type=\u0022text\/css\u0022\u003E\u003C!--td {border: 1px solid #ccc;}br {mso-data-placement:same-cell;}--\u003E\r\n\u003C\/style\u003E\r\nWelcome everyone who is interested in the Servo project to join!\u003C\/p\u003E\r\n\r\n\u003Cp\u003EIn this talk, I will talk about\u003C\/p\u003E\r\n\r\n\u003Cul\u003E\r\n\t\u003Cli\u003EWhat Servo project is?\u003C\/li\u003E\r\n\t\u003Cli\u003EHow to contribute to Servo?\u003C\/li\u003E\r\n\t\u003Cli\u003EHow to test what you implemented?\u003C\/li\u003E\r\n\t\u003Cli\u003EHow to find tasks to do?\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n","venue":{"name":"Hall A","weight":1},"language":"English","language_sym_interp":[],"level":"Beginner","speakers":[{"name":"CYBAI","community":"HERP Inc.","country":"Taiwan","description":"\u003Cp\u003ECybai is a Software Engineer at HERP, Inc., experienced with Cycle.js on front-end side and Yesod on back-end side. Also, he is an active contributor of the Servo project.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-06\/CYBAI.jpeg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/x5stcqqj"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/hitchhikers-guide-servo-contributor"},{"topic":true,"remote_presentation":false,"display":"A business\/brand database developed like software package repositories","description":"\u003Cp\u003EI will discuss how I apply some ideas from software package repositories into a business\/brand database that stores a list of businesses of \u0026nbsp;Hong Kong.\u003C\/p\u003E\r\n\r\n\u003Cp\u003ESource code and data: \u003Ca href=\u0022https:\/\/github.com\/giffon\/charleywong\u0022\u003Ehttps:\/\/github.com\/giffon\/charleywong\u003C\/a\u003E\u003C\/p\u003E\r\n","venue":{"name":"Hall B","weight":2},"language":"English","language_sym_interp":[],"level":"Beginner","speakers":[{"name":"Andy Li","community":"Haxe Foundation","country":"Hong Kong","description":"\u003Cp\u003EAndy Li has been an active open source developer, mostly active in the Haxe community for many years. He is a Debian developer, also a package maintainer for a few Linux distros.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EHe is now working on his startup, Giffon, which is a crowd-gifting platform where you can state what you want and let your friends collectively buy it as a gift for you.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EHe obtained his Ph.D. in the School of Creative Media, City University of Hong Kong. He is interested in programming as well as mobile user interface, interactivity, installation art, and generative graphics.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2019-03\/Andy%20Li.jpeg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/yppejr0t"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/businessbrand-database-developed-software-package-repositories"}]},{"startTime":"17:10","endTime":"17:40","events":[{"topic":true,"remote_presentation":true,"display":"Build an API service using Ktor rapidly","description":"\u003Cp\u003EKotlin is not only for mobile development but also for backend (it could be used everywhere actually!). In JetBrains, we build Ktor framework for backend development such as website, API, microservice. In this talk, I will introduce what Ktor is, how to integrated with Exposed SQL library, demonstrate how to build a RESTful API service in just a few lines of code. After listening to this talk, you will learn how to build API with Ktor rapidly.\u003C\/p\u003E\r\n","venue":{"name":"Hall A","weight":1},"language":"English","language_sym_interp":[],"level":"Beginner","speakers":[{"name":"Shengyou Fan","community":"JetBrains","country":"Taiwan","description":"\u003Cp\u003EShengyou is Developer Advocate at JetBrains. He is fascinated with researching new technology and fond of skills that increase productivity. In charge of promoting technology such as Kotlin, IntelliJ IDEA and provide solutions. He passionately managed open source communities and contributed to those for 6 years.\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/Shengyou%20Fan.jpg"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/tb7ogiwb"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/build-api-service-using-ktor-rapidly"},{"topic":true,"remote_presentation":false,"display":"Launch wars.vote4.hk within 2 days with $0 cost","description":"\u003Cp\u003EWhat we learned from our previous \u003Ca href=\u0022https:\/\/vote4.hk\/\u0022\u003Evote4.hk\u003C\/a\u003E project, and how we design \u003Ca href=\u0022https:\/\/wars.vote4.hk\/\u0022\u003Ewars.vote4.hk\u003C\/a\u003E to optimize cost and workflow of an opensource project.\u003C\/p\u003E\r\n","venue":{"name":"Hall B","weight":2},"language":"English","language_sym_interp":[],"level":"Intermediate","speakers":[{"name":"Nandi Wong","community":"Kintohub","country":"Hong Kong","description":"\u003Cp\u003EContributors on \u003Ca href=\u0022https:\/\/vote4.hk\/\u0022\u003Evote4.hk\u003C\/a\u003E\/\u003Ca href=\u0022https:\/\/wars.vote4.hk\/\u0022\u003Ewars.vote4.hk\u003C\/a\u003E, Backend Engineer @\u003Ca href=\u0022https:\/\/www.kintohub.com\/\u0022\u003EKintoHub\u003C\/a\u003E\u003C\/p\u003E\r\n","thumbnail":"https:\/\/data.hkoscon.org\/sites\/default\/files\/2020-05\/Nandi%20Wong.png"}],"video_streaming":null,"slido":{"url":"https:\/\/app.sli.do\/event\/k9uwukcx"},"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/launch-warsvote4hk-within-2-days-0-cost"}]},{"startTime":"17:40","endTime":"17:45","events":[{"topic":false,"remote_presentation":false,"display":"Closing","description":"","venue":{"name":"","weight":0},"language":"","language_sym_interp":[],"level":"","speakers":[],"video_streaming":null,"slido":null,"video_recordings":[],"slides":[],"internal":"https:\/\/data.hkoscon.org\/event\/closing-0"}]}]}]}